Q1. List any five functions of the pandas library with execution.

read_csv: This function is used to read a CSV file and create a DataFrame.

In [2]:
#df = pd.read_csv('data.csv')
##head: This function is used to display the first few rows of a DataFrame.
#df.head()

info: This function provides a concise summary of a DataFrame, including the column names, data types, and non-null values.

In [3]:
import pandas as pd
data = {'Name': ['John', 'Emma', 'Peter', 'Olivia', 'Michael'],
        'Age': [25, 28, 22, 30, 35],
        'City': ['New York', 'London', 'Paris', 'Sydney', 'Tokyo']}
df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

describe: This function computes various summary statistics of numeric columns in a DataFrame, such as count, mean, min, max, and quartiles.

In [4]:
data = {'Name': ['John', 'Emma', 'Peter', 'Olivia', 'Michael'],
        'Age': [25, 28, 22, 30, 35],
        'City': ['New York', 'London', 'Paris', 'Sydney', 'Tokyo']}
df = pd.DataFrame(data)
print(df.describe())

             Age
count   5.000000
mean   28.000000
std     4.949747
min    22.000000
25%    25.000000
50%    28.000000
75%    30.000000
max    35.000000

groupby: This function is used to group data in a DataFrame based on one or more columns, and then perform operations on those groups.

In [5]:
data = {'Name': ['John', 'Emma', 'Peter', 'Olivia', 'Michael'],
        'Age': [25, 28, 22, 30, 35],
        'City': ['New York', 'London', 'Paris', 'Sydney', 'Tokyo']}
df = pd.DataFrame(data)
grouped_df = df.groupby('City')
grouped_df.max()

             Name  Age
City
London       Emma   28
New York     John   25
Paris       Peter   22
Sydney     Olivia   30
Tokyo     Michael   35

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [6]:
data={
    'A':[12,13,14,15,25],
    'B':[23,34,45,46,36],
    'C':[56,67,68,69,79]
}
df=pd.DataFrame(data)
df

    A   B   C
0  12  23  56
1  13  34  67
2  14  45  68
3  15  46  69
4  25  36  79

In [7]:
def reindex_with_increment(df):
    df = df.reset_index(drop=True)
    new_index = pd.RangeIndex(start=1, stop=2*len(df), step=2)
    df.set_index(new_index, inplace=True)
    return df

In [8]:
reindex_with_increment(df)

    A   B   C
1  12  23  56
3  13  34  67
5  14  45  68
7  15  46  69
9  25  36  79

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [9]:
#example
df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})
df

   Values
0      10
1      20
2      30
3      40
4      50

In [10]:
def for_sum(df):
    values_sum=df['Values'].iloc[0:3].sum()
    return values_sum

In [11]:
for_sum(df)

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [12]:
# Example 
df = pd.DataFrame({'Text': ['Hello, how are you?', 'I am doing well.', 'Python is great!']})
df

                  Text
0  Hello, how are you?
1     I am doing well.
2     Python is great!

In [54]:
def new_column(df,x):
    value=df['Text'].str.split().apply(len)
    df['Word_Count']=value
    return df

In [55]:
new_column(df, 0)

                  Text  Word_Count
0  Hello, how are you?           4
1     I am doing well.           4
2     Python is great!           3

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size: This attribute returns the total number of elements in the DataFrame, which is calculated as the product of the number of rows and the number of columns. It represents the total number of cells or values in the DataFrame. The size attribute returns a single integer value.

In [56]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
print(df.size)

6

DataFrame.shape: This attribute returns a tuple representing the dimensions of the DataFrame. It provides the number of rows followed by the number of columns in the DataFrame. The shape attribute returns a tuple of integers.

In [57]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
print(df.shape)

(3, 2)

Q6. Which function of pandas do we use to read an excel file?

We can use the read_excel() function to read an Excel file and create a DataFrame from its contents. This function is specifically designed to handle Excel files and offers various parameters to customize the reading process.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [76]:
df = pd.DataFrame({'Email': ['john.doe@example.com', 'Varun@example.com', 'Abhishek@example.com']})
df

                  Email
0  john.doe@example.com
1     Varun@example.com
2  Abhishek@example.com

In [95]:
def exrtract_username(df):
    username=df['Email'].str.split('@').apply(lambda x: x[0])
    df["Usernames"]=username
    return df

In [96]:
exrtract_username(df)

                  Email Usernames
0  john.doe@example.com  john.doe
1     Varun@example.com     Varun
2  Abhishek@example.com  Abhishek

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
  A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

In [141]:
df =pd.DataFrame({
    'A':[3,8,6,2,9],
    'B':[5,2,9,3,1],
    'C':[1,7,4,5,2]
})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [146]:
def new_data(df):
    data=df[(df["A"]>5) & (df["B"]<10)]
    return data

In [147]:
new_data(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [148]:
df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})
df

   Values
0      10
1      20
2      30
3      40
4      50

In [151]:
def calculate(df):
    df['Values'].mean()
    df['Values'].median()
    df['Values'].std()
    return  df['Values'].mean(), df['Values'].median(), df['Values'].std()

In [152]:
calculate(df)

(30.0, 30.0, 15.811388300841896)

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [154]:
df = pd.DataFrame({'Date': pd.date_range(start='2023-06-01', periods=10),
                   'Sales': [10, 15, 12, 18, 20, 17, 25, 22, 19, 16]})
df

        Date  Sales
0 2023-06-01     10
1 2023-06-02     15
2 2023-06-03     12
3 2023-06-04     18
4 2023-06-05     20
5 2023-06-06     17
6 2023-06-07     25
7 2023-06-08     22
8 2023-06-09     19
9 2023-06-10     16

In [ ]:
df['Sales'].rolling()

In [155]:
def average(df):
    df['MovingAverage']=df['Sales'].rolling(window=7,min_periods=1).mean()
    return df

In [157]:
average(df)

        Date  Sales  MovingAverage
0 2023-06-01     10      10.000000
1 2023-06-02     15      12.500000
2 2023-06-03     12      12.333333
3 2023-06-04     18      13.750000
4 2023-06-05     20      15.000000
5 2023-06-06     17      15.333333
6 2023-06-07     25      16.714286
7 2023-06-08     22      18.428571
8 2023-06-09     19      19.000000
9 2023-06-10     16      19.571429

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
    Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

   Date      Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [160]:
df=pd.DataFrame({'Date':pd.date_range(start='2023-01-01', periods=5)})
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [163]:
def new_data(df):
    df['Weekday']=df['Date'].dt.day_name()
    return df

In [164]:
new_data(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [168]:
df=pd.DataFrame({'Date':pd.date_range('2022-12-30',periods=34)})
df

         Date
0  2022-12-30
1  2022-12-31
2  2023-01-01
3  2023-01-02
4  2023-01-03
5  2023-01-04
6  2023-01-05
7  2023-01-06
8  2023-01-07
9  2023-01-08
10 2023-01-09
11 2023-01-10
12 2023-01-11
13 2023-01-12
14 2023-01-13
15 2023-01-14
16 2023-01-15
17 2023-01-16
18 2023-01-17
19 2023-01-18
20 2023-01-19
21 2023-01-20
22 2023-01-21
23 2023-01-22
24 2023-01-23
25 2023-01-24
26 2023-01-25
27 2023-01-26
28 2023-01-27
29 2023-01-28
30 2023-01-29
31 2023-01-30
32 2023-01-31
33 2023-02-01

In [171]:
def selected_rows(df):
        start=pd.to_datetime('2023-01-01')
        end=pd.to_datetime('2023-01-31')
        selected=df[df["Date"].between(start,end)]
        return selected

In [173]:
selected_rows(df)

         Date
2  2023-01-01
3  2023-01-02
4  2023-01-03
5  2023-01-04
6  2023-01-05
7  2023-01-06
8  2023-01-07
9  2023-01-08
10 2023-01-09
11 2023-01-10
12 2023-01-11
13 2023-01-12
14 2023-01-13
15 2023-01-14
16 2023-01-15
17 2023-01-16
18 2023-01-17
19 2023-01-18
20 2023-01-19
21 2023-01-20
22 2023-01-21
23 2023-01-22
24 2023-01-23
25 2023-01-24
26 2023-01-25
27 2023-01-26
28 2023-01-27
29 2023-01-28
30 2023-01-29
31 2023-01-30
32 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?


The first and foremost library that needs to be imported to use the basic functions of pandas is the pandas library itself.

In [174]:
import pandas as pd